export const checkpoints = [
  { question: 1, title: "Предприниматель", icon: "🏁" },
  { question: 12, title: "Стойкий основатель", icon: "🎖️" },
  { question: 20, title: "Железная воля", icon: "💪" },
  { question: 25, title: "Целеустремлённый лидер", icon: "🏆" }
];

export const preCheckpointMessages = {
  11: "Вы уже обошли 37% тех, кто сдался. Ещё вопрос и вы войдёте в 67%, кто достиг рубеж «Стойкий основатель»",
  19: "После ответа вы войдёте в 53%, кто достиг рубежа «Железная воля»",
  24: "Последний вопрос и вы будете в числе 36%, кто не сдался и прошёл диагностику"
};

export const motivationalMessages = {
  2: "Старт взят. 100% собственников начинают полные энтузиазма, но многие закрывают тест, испугавшись первого серьёзного вопроса. Вы же идёте дальше!",
  6: "Хороший темп. Обычно на этом этапе отсеиваются те, кто ищет «волшебную таблетку», кажется вы настроены по-взрослому.",
  15: "Вы в числе стойкого меньшинства. Половина ваших конкурентов уже бросили бы этот аудит. Продолжайте!",
  23: "Финишная прямая. 61% к этому моменту предпочли остаться в неведении. Кажется, вы умеете доводить дела до конца. Сделайте последний рывок."
};
